/*
 插入数据库初始值
 */

use db_XMall_user;
-- 插入用户信息
insert into user_info(username, password, balance, phone_number, gender_index, age, create_time)
values ('掌声落下', '123456', 5000.00, '12345678901', 1, 20, now()),
       ('他夏了夏天', '123456', 5000.00, '12345678901', 2, 40, now()),
       ('蝉想', '123456', 5000.00, '12345678901', 1, 22, now()),
       ('包围', '123456', 5000.00, '12345678901', 1, 18, now()),
       ('御花园', '123456', 5000.00, '12345678901', 0, 25, now()),
       ('彼得与狼', '123456', 5000.00, '12345678901', 2, 30, now()),
       ('共舞', '123456', 5000.00, '12345678901', 0, 35, now()),
       ('无眠', '123456', 5000.00, '12345678901', 0, 40, now()),
       ('狂热', '123456', 5000.00, '12345678901', 0, 38, now()),
       ('煽动', '123456', 5000.00, '12345678901', 0, 52, now()),
       ('近未来', '123456', 5000.00, '12345678901', 0, 43, now());

-- 插入地址信息
insert into address_info(user_id, address, receiver, phone_number, is_default)
values (100001, '北京市东城区东直门街道', '张三', '12345678901', true),
       (100002, '武汉市洪山区洪街街道', '吴青峰', '12345678903', true),
       (100002, '北京市西城区西直门街道', '李四', '12345678902', false),
       (100004, '长沙市雨花区雨花街道', '刘家凯', '12345678904', true),
       (100004, '北京市西城区西直门街道', '史俊威', '12345678905', false),
       (100004, '北京市东城区东直门街道', '谢馨仪', '12345678906', false),
       (100006, '北京市西城区西直门街道', '龚钰祺', '12345678907', true),
       (100007, '北京市东城区东直门街道', '何景扬', '12345678908', true);
#
# -- 插入购物车信息
# insert into cart_info(user_id, goods_id, quantity)
# values (100028, 1, 1),
#        (100001, 2, 2),
#        (100002, 1, 2),
#        (100005, 3, 1),
#        (100006, 1, 3),
#        (100007, 4, 1);
#
# -- 插入关注信息
# insert into follow_info(user_id, store_id)
# values (100001, 1001),
#        (100001, 1002),
#        (100001, 1003),
#        (100003, 1001),
#        (100006, 1004),
#        (100006, 1005);
#
# -- 插入浏览记录
# insert into history_info(user_id, goods_id, time)
# values (100001, 1, now()),
#        (100001, 2, now()),
#        (100001, 3, now()),
#        (100001, 4, now()),
#        (100002, 1, now()),
#        (100002, 2, now()),
#        (100002, 4, now()),
#        (100003, 1, now()),
#        (100003, 2, now());

use db_XMall_goods;
-- 插入商品信息
insert into goods_info(goods_name, store_id, price, trans_price, quantity, sale_number, create_time, category_index,
                       insurance, transportation)
values ('优质大米', 1008, 50.00, 0.00, 100, 30, now(), 0, '七天无理由退货', '顺丰'),
       ('新鲜草莓', 1008, 25.00, 0.00, 100, 60, now(), 1, '七天无理由退货', '韵达'),
       ('天然养殖鸡蛋', 1008, 6.00, 0.00, 100, 40, now(), 2, '七天无理由退货', '极兔'),
       ('手工豆腐干', 1009, 18.00, 0.00, 100, 20, now(), 3, '七天无理由退货', '邮政'),
       ('多功能锄头', 1009, 80.00, 0.00, 100, 55, now(), 4, '七天无理由退货', '中通'),
       ('精美节庆礼盒', 1009, 150.00, 0.00, 100, 36, now(), 5, '七天无理由退货', '圆通'),
       ('有机小麦面粉', 1010, 30.00, 0.00, 100, 88, now(), 0, '七天无理由退货', '申通'),
       ('新鲜西瓜', 1010, 10.00, 0.00, 100, 79, now(), 1, '七天无理由退货', '京东'),
       ('优质牛肉', 1010, 120.00, 0.00, 100, 12, now(), 2, '七天无理由退货', '顺丰'),
       ('纯手工蜂蜜', 1011, 60.00, 0.00, 100, 91, now(), 3, '七天无理由退货', '韵达'),
       ('有机玉米', 1011, 45.00, 0.00, 100, 25, now(), 0, '七天无理由退货', '顺丰'),
       ('新鲜樱桃', 1011, 80.00, 0.00, 100, 18, now(), 1, '七天无理由退货', '韵达'),
       ('天然鸭蛋', 1012, 8.00, 0.00, 100, 32, now(), 2, '七天无理由退货', '邮政'),
       ('手工火腿', 1012, 50.00, 0.00, 100, 10, now(), 3, '七天无理由退货', '中通'),
       ('农家自制果酱', 1012, 35.00, 0.00, 100, 45, now(), 4, '七天无理由退货', '圆通'),
       ('节庆特供礼品篮', 1013, 200.00, 0.00, 100, 22, now(), 5, '七天无理由退货', '申通'),
       ('有机小米', 1013, 28.00, 0.00, 100, 60, now(), 0, '七天无理由退货', '京东'),
       ('新鲜菠萝', 1013, 15.00, 0.00, 100, 48, now(), 1, '七天无理由退货', '顺丰'),
       ('优质羊肉', 1014, 150.00, 0.00, 100, 8, now(), 2, '七天无理由退货', '韵达'),
       ('纯正蜂蜜饼', 1014, 40.00, 0.00, 100, 55, now(), 3, '七天无理由退货', '邮政'),
       ('优质糯米', 1014, 38.00, 0.00, 100, 28, now(), 0, '七天无理由退货', '中通'),
       ('新鲜橙子', 1015, 12.00, 0.00, 100, 70, now(), 1, '七天无理由退货', '圆通'),
       ('天然鹌鹑蛋', 1015, 10.00, 0.00, 100, 36, now(), 2, '七天无理由退货', '申通'),
       ('手工火龙果干', 1015, 25.00, 0.00, 100, 15, now(), 3, '七天无理由退货', '京东'),
       ('农家自制腊肉', 1016, 60.00, 0.00, 100, 40, now(), 4, '七天无理由退货', '顺丰'),
       ('节庆特供礼品包', 1016, 180.00, 0.00, 100, 20, now(), 5, '七天无理由退货', '韵达'),
       ('有机黑米', 1016, 32.00, 0.00, 100, 50, now(), 0, '七天无理由退货', '邮政'),
       ('新鲜柚子', 1017, 18.00, 0.00, 100, 42, now(), 1, '七天无理由退货', '中通'),
       ('优质鸡肉', 1017, 100.00, 0.00, 100, 15, now(), 2, '七天无理由退货', '圆通'),
       ('纯天然野花蜂蜜', 1017, 55.00, 0.00, 100, 48, now(), 3, '七天无理由退货', '申通');

-- 插入商品评论信息
use db_XMall_goods;
insert into comment_info(goods_id, sender_id, message, send_time, point)
values (34, 100014, '这个有机小米真是太棒了，口感细腻，煮出来的粥特别香！', now(), 5),
       (34, 100015, '非常喜欢这款有机小米，做出来的米饭特别松软，健康又美味。', now(), 5),
       (34, 100016, '我家人都很喜欢这款小米粥，纯天然无添加，吃得很放心。', now(), 4),
       (34, 100017, '第一次尝试有机小米，没想到味道这么好，回购无疑！', now(), 5),
       (34, 100018, '小米粥真的很养胃，这款有机小米味道浓郁，强烈推荐！', now(), 4),
       (34, 100019, '买了这款有机小米给孩子吃，他特别喜欢，每天都要喝小米粥。', now(), 5),
       (34, 100039, '煮了一锅小米粥，全家人都赞不绝口，真的是好产品。', now(), 4),
       (34, 100038, '小米里面有虫子，差评！', now(), 1),
       (35, 100020, '这个新鲜菠萝真是太好吃了，甜中带酸，口感非常棒！', now(), 5),
       (35, 100021, '买了这个菠萝回来，整个家里都弥漫着菠萝的香味，非常新鲜。', now(), 5),
       (35, 100022, '新鲜的菠萝切开来，汁水四溢，孩子们特别喜欢。', now(), 5),
       (35, 100023, '这个菠萝有点酸，可能还不够熟，不过还是很新鲜。', now(), 3),
       (35, 100024, '收到的菠萝外观很好看，味道也很不错，值得购买。', now(), 4),
       (35, 100025, '第一次买这个新鲜菠萝，真的很不错，味道特别好。', now(), 5),
       (35, 100026, '菠萝真的很甜，吃起来很爽口，一次买了两个，家人都很喜欢。', now(), 5),
       (35, 100027, '这个菠萝有点青涩，感觉不太成熟，希望改进。', now(), 2),
       (35, 100028, '买了这个新鲜菠萝来做菠萝饭，味道特别好，家人都很满意。', now(), 5),
       (35, 100029, '这个菠萝真是物超所值，口感很好，价格也很合理。', now(), 4),
       (35, 100030, '新鲜的菠萝果肉饱满，吃起来很有口感，很喜欢。', now(), 5),
       (35, 100031, '菠萝的甜味刚刚好，不会太甜，也不会太酸，正好适合我。', now(), 4),
       (35, 100032, '送来的菠萝有点磕碰，不过味道还是挺好的，希望下次包装能更好。', now(), 3),
       (35, 100033, '菠萝真的很新鲜，切开来果肉金黄，看着就很有食欲。', now(), 5),
       (35, 100034, '买了这个菠萝来做菠萝汁，味道很正，家人都很喜欢喝。', now(), 5),
       (45, 100034, '这个新鲜柚子真是太好吃了，果肉饱满多汁，酸甜适中！', now(), 5),
       (45, 100033, '买了这个柚子回来，全家人都很喜欢，味道非常好。', now(), 5),
       (45, 100037, '新鲜的柚子切开来，香气扑鼻，特别清爽。', now(), 5),
       (45, 100032, '这个柚子有点酸，不过还是很新鲜，喜欢酸味的可以试试。', now(), 3),
       (45, 100031, '收到的柚子外观很好看，果肉也很不错，值得推荐。', now(), 4),
       (45, 100030, '第一次买这个新鲜柚子，味道特别好，皮薄肉多。', now(), 5),
       (45, 100029, '柚子真的很甜，吃起来很爽口，家人都很喜欢。', now(), 5),
       (45, 100028, '这个柚子有点干，感觉不太新鲜，希望能改进。', now(), 2),
       (45, 100027, '买了这个新鲜柚子来做柚子茶，味道特别好，家人都很满意。', now(), 5),
       (45, 100026, '这个柚子真是物超所值，口感很好，价格也很合理。', now(), 4),
       (45, 100025, '新鲜的柚子果肉饱满，吃起来很有口感，很喜欢。', now(), 5),
       (45, 100024, '柚子的酸甜度刚刚好，不会太酸，也不会太甜，正好适合我。', now(), 4),
       (45, 100023, '送来的柚子有点磕碰，不过味道还是挺好的，希望下次包装能更好。', now(), 3),
       (45, 100022, '柚子真的很新鲜，切开来果肉晶莹剔透，看着就很有食欲。', now(), 5),
       (45, 100021, '买了这个柚子来做柚子汁，味道很正，家人都很喜欢喝。', now(), 5),
       (46, 100020, '这款优质鸡肉真的非常嫩滑，煮出来的汤特别鲜美！', now(), 5),
       (46, 100019, '鸡肉很新鲜，口感很好，做出来的菜特别香。', now(), 5),
       (46, 100018, '买了这款鸡肉来炖汤，味道非常好，全家人都很喜欢。', now(), 5),
       (46, 100017, '鸡肉有点硬，不是特别满意，希望能改进。', now(), 3),
       (46, 100018, '这款优质鸡肉外观很好，肉质细腻，吃起来非常好。', now(), 5),
       (46, 100019, '用这款鸡肉做了红烧鸡块，家人都说味道很棒。', now(), 4),
       (46, 100020, '这款鸡肉真的很不错，价格合理，质量上乘。', now(), 5),
       (46, 100021, '买了这款鸡肉做了鸡肉卷，非常好吃，推荐！', now(), 5),
       (46, 100022, '鸡肉新鲜度一般，煮出来的汤味道还行。', now(), 3),
       (46, 100023, '这款鸡肉包装很好，没有血水，质量非常好。', now(), 5),
       (46, 100024, '用这款鸡肉做了咖喱鸡，味道非常棒，全家都很喜欢。', now(), 5),
       (46, 100025, '鸡肉质量很好，没有腥味，吃起来非常放心。', now(), 4),
       (46, 100026, '鸡肉有点老，不太好咀嚼，不过味道还可以。', now(), 3),
       (46, 100027, '买了这款鸡肉做了鸡肉沙拉，味道很不错。', now(), 4),
       (46, 100028, '鸡肉很嫩，做出来的菜特别入味，非常好吃。', now(), 5),
       (47, 100014, '这款纯天然野花蜂蜜真的很纯正，味道很浓郁，特别好喝！', now(), 5),
       (47, 100015, '蜂蜜的质量很好，天然无添加，吃起来很放心。', now(), 5),
       (47, 100016, '买了这款蜂蜜来泡茶，味道特别好，甜而不腻。', now(), 5),
       (47, 100017, '蜂蜜有点稀，不是特别满意，希望能改进。', now(), 3),
       (47, 100018, '这款野花蜂蜜的香气很好，喝起来非常舒服。', now(), 5),
       (47, 100019, '用这款蜂蜜做了蜂蜜柠檬水，家人都说味道很棒。', now(), 4),
       (47, 100020, '这款蜂蜜真的很不错，价格合理，质量上乘。', now(), 5),
       (47, 100021, '买了这款蜂蜜做了蜂蜜蛋糕，非常好吃，推荐！', now(), 5),
       (47, 100022, '蜂蜜味道一般，甜度还行。', now(), 3),
       (47, 100023, '这款蜂蜜包装很好，没有渗漏，质量非常好。', now(), 5),
       (47, 100024, '用这款蜂蜜做了蜂蜜柚子茶，味道非常棒，全家都很喜欢。', now(), 5),
       (47, 100025, '蜂蜜质量很好，没有杂质，吃起来非常放心。', now(), 4),
       (47, 100026, '蜂蜜有点苦，不太喜欢，不过可以接受。', now(), 3),
       (47, 100027, '买了这款蜂蜜做了蜂蜜面膜，效果很不错。', now(), 4),
       (47, 100028, '蜂蜜很甜，喝起来特别好，非常满意。', now(), 5);

use db_XMall_store;
-- 插入店铺信息
insert into store_info(store_name, password, owner_name, phone_number, credit_id, reputation,
                       revenue, fans_number, create_time)
values ('行板如歌', '123456', '张哲华', '12345678901', 430, 5.0, 1000000, 0, now()),
       ('静水流深', '123456', '王天放', '12345678901', 430, 4.8, 1000000, 0, now()),
       ('拾穗行歌', '123456', '刘思维', '12345678901', 430, 4.9, 1000000, 0, now()),
       ('日光狂热', '123456', '松天硕', '12345678901', 430, 4.1, 1000000, 0, now()),
       ('故事未了', '123456', '郭耘奇', '12345678901', 430, 4.8, 1000000, 0, now()),
       ('寂寞拥挤', '123456', '谢泽成', '12345678901', 430, 4.5, 1000000, 0, now()),
       ('浮云悠游', '123456', '雷淞然', '12345678901', 430, 4.6, 1000000, 0, now()),
       ('片刻永恒', '123456', '蒋诗萌', '12345678901', 430, 4.9, 1000000, 0, now()),
       ('卮言春天', '123456', '闫佩伦', '12345678901', 430, 4.7, 1000000, 0, now()),
       ('痛快哀艳', '123456', '张祐维', '12345678901', 430, 4.3, 1000000, 0, now());

use db_XMall_order;
-- 插入订单信息
insert into order_info(user_id, store_id, total_price, trans_price, address_id, pay_time, pay_way_index, send_time,
                       receive_time, finish_time, status_index)
values (100001, 1001, 5999.00, 0.00, 100001, now(), 0, null, null, null, 0),
       (100003, 1004, 5999.00, 0.00, 100001, now(), 1, now(), now(), now(), 4);

-- 插入订单商品信息
insert into order_item_info(order_id, goods_id, quantity, price)
values (1, 1, 1, 5999.00),
       (2, 7, 1, 3999.00),
       (2, 8, 1, 2000.00);

use db_XMall_after_sale;
-- 插入售后信息
insert into after_sale_info(user_id, store_id, order_id, goods_id, category_index, reason, result_index, start_time,
                            finish_time, is_finish)
values (100003, 1004, 2, 7, 0, '不想要了', 0, now(), now(), true);

use db_XMall_preference;
-- 插入优惠信息
insert into preference_info(goods_id, category_index, pref_name, pref_id, start_time, end_time)
values (1, 0, '立减10元', 1, now(), now());

-- 插入降价信息
insert into reduction_info(reduction)
values (10.00);