/*
 插入数据库初始值
 */

use db_XMall_user;
-- 插入用户信息
insert into user_info(username, password, balance, phone_number, gender_index, age, create_time)
values ('掌声落下', '123456', 5000.00, '12345678901', 1, 20, now()),
       ('他夏了夏天', '123456', 5000.00, '12345678901', 2, 40, now()),
       ('蝉想', '123456', 5000.00, '12345678901', 1, 22, now()),
       ('包围', '123456', 5000.00, '12345678901', 1, 18, now()),
       ('御花园', '123456', 5000.00, '12345678901', 0, 25, now()),
       ('彼得与狼', '123456', 5000.00, '12345678901', 2, 30, now()),
       ('共舞', '123456', 5000.00, '12345678901', 0, 35, now()),
       ('无眠', '123456', 5000.00, '12345678901', 0, 40, now()),
       ('狂热', '123456', 5000.00, '12345678901', 0, 38, now()),
       ('煽动', '123456', 5000.00, '12345678901', 0, 52, now()),
       ('近未来', '123456', 5000.00, '12345678901', 0, 43, now());

-- 插入地址信息
insert into address_info(user_id, address, receiver, phone_number, is_default)
values (100001, '北京市东城区东直门街道', '张三', '12345678901', true),
       (100002, '武汉市洪山区洪街街道', '吴青峰', '12345678903', true),
       (100002, '北京市西城区西直门街道', '李四', '12345678902', false),
       (100004, '长沙市雨花区雨花街道', '刘家凯', '12345678904', true),
       (100004, '北京市西城区西直门街道', '史俊威', '12345678905', false),
       (100004, '北京市东城区东直门街道', '谢馨仪', '12345678906', false),
       (100006, '北京市西城区西直门街道', '龚钰祺', '12345678907', true),
       (100007, '北京市东城区东直门街道', '何景扬', '12345678908', true);
#
# -- 插入购物车信息
# insert into cart_info(user_id, goods_id, quantity)
# values (100028, 1, 1),
#        (100001, 2, 2),
#        (100002, 1, 2),
#        (100005, 3, 1),
#        (100006, 1, 3),
#        (100007, 4, 1);
#
# -- 插入关注信息
# insert into follow_info(user_id, store_id)
# values (100001, 1001),
#        (100001, 1002),
#        (100001, 1003),
#        (100003, 1001),
#        (100006, 1004),
#        (100006, 1005);
#
# -- 插入浏览记录
# insert into history_info(user_id, goods_id, time)
# values (100001, 1, now()),
#        (100001, 2, now()),
#        (100001, 3, now()),
#        (100001, 4, now()),
#        (100002, 1, now()),
#        (100002, 2, now()),
#        (100002, 4, now()),
#        (100003, 1, now()),
#        (100003, 2, now());

use db_XMall_goods;
-- 插入商品信息
insert into goods_info(goods_name, store_id, price, trans_price, quantity, sale_number, create_time, category_index,
                       insurance, transportation)
values ('优质大米', 1008, 50.00, 0.00, 100, 30, now(), 0, '七天无理由退货', '顺丰'),
       ('新鲜草莓', 1008, 25.00, 0.00, 100, 60, now(), 1, '七天无理由退货', '韵达'),
       ('天然养殖鸡蛋', 1008, 6.00, 0.00, 100, 40, now(), 2, '七天无理由退货', '极兔'),
       ('手工豆腐干', 1009, 18.00, 0.00, 100, 20, now(), 3, '七天无理由退货', '邮政'),
       ('多功能锄头', 1009, 80.00, 0.00, 100, 55, now(), 4, '七天无理由退货', '中通'),
       ('精美节庆礼盒', 1009, 150.00, 0.00, 100, 36, now(), 5, '七天无理由退货', '圆通'),
       ('有机小麦面粉', 1010, 30.00, 0.00, 100, 88, now(), 0, '七天无理由退货', '申通'),
       ('新鲜西瓜', 1010, 10.00, 0.00, 100, 79, now(), 1, '七天无理由退货', '京东'),
       ('优质牛肉', 1010, 120.00, 0.00, 100, 12, now(), 2, '七天无理由退货', '顺丰'),
       ('纯手工蜂蜜', 1011, 60.00, 0.00, 100, 91, now(), 3, '七天无理由退货', '韵达'),
       ('有机玉米', 1011, 45.00, 0.00, 100, 25, now(), 0, '七天无理由退货', '顺丰'),
       ('新鲜樱桃', 1011, 80.00, 0.00, 100, 18, now(), 1, '七天无理由退货', '韵达'),
       ('天然鸭蛋', 1012, 8.00, 0.00, 100, 32, now(), 2, '七天无理由退货', '邮政'),
       ('手工火腿', 1012, 50.00, 0.00, 100, 10, now(), 3, '七天无理由退货', '中通'),
       ('农家自制果酱', 1012, 35.00, 0.00, 100, 45, now(), 4, '七天无理由退货', '圆通'),
       ('节庆特供礼品篮', 1013, 200.00, 0.00, 100, 22, now(), 5, '七天无理由退货', '申通'),
       ('有机小米', 1013, 28.00, 0.00, 100, 60, now(), 0, '七天无理由退货', '京东'),
       ('新鲜菠萝', 1013, 15.00, 0.00, 100, 48, now(), 1, '七天无理由退货', '顺丰'),
       ('优质羊肉', 1014, 150.00, 0.00, 100, 8, now(), 2, '七天无理由退货', '韵达'),
       ('纯正蜂蜜饼', 1014, 40.00, 0.00, 100, 55, now(), 3, '七天无理由退货', '邮政'),
       ('优质糯米', 1014, 38.00, 0.00, 100, 28, now(), 0, '七天无理由退货', '中通'),
       ('新鲜橙子', 1015, 12.00, 0.00, 100, 70, now(), 1, '七天无理由退货', '圆通'),
       ('天然鹌鹑蛋', 1015, 10.00, 0.00, 100, 36, now(), 2, '七天无理由退货', '申通'),
       ('手工火龙果干', 1015, 25.00, 0.00, 100, 15, now(), 3, '七天无理由退货', '京东'),
       ('农家自制腊肉', 1016, 60.00, 0.00, 100, 40, now(), 4, '七天无理由退货', '顺丰'),
       ('节庆特供礼品包', 1016, 180.00, 0.00, 100, 20, now(), 5, '七天无理由退货', '韵达'),
       ('有机黑米', 1016, 32.00, 0.00, 100, 50, now(), 0, '七天无理由退货', '邮政'),
       ('新鲜柚子', 1017, 18.00, 0.00, 100, 42, now(), 1, '七天无理由退货', '中通'),
       ('优质鸡肉', 1017, 100.00, 0.00, 100, 15, now(), 2, '七天无理由退货', '圆通'),
       ('纯天然野花蜂蜜', 1017, 55.00, 0.00, 100, 48, now(), 3, '七天无理由退货', '申通');

-- 插入商品评论信息
insert into comment_info(goods_id, sender_id, message, send_time, point)
values (1, 100001, '真好用', now(), 5),
       (1, 100002, '孩子很喜欢', now(), 4),
       (4, 100002, '敏感肌也能用', now(), 3),
       (6, 100005, '邻居都馋疯了', now(), 5);

use db_XMall_store;
-- 插入店铺信息
insert into store_info(store_name, password, owner_name, phone_number, credit_id, reputation,
                       revenue, fans_number, create_time)
values ('行板如歌', '123456', '张哲华', '12345678901', 430, 5.0, 1000000, 0, now()),
       ('静水流深', '123456', '王天放', '12345678901', 430, 4.8, 1000000, 0, now()),
       ('拾穗行歌', '123456', '刘思维', '12345678901', 430, 4.9, 1000000, 0, now()),
       ('日光狂热', '123456', '松天硕', '12345678901', 430, 4.1, 1000000, 0, now()),
       ('故事未了', '123456', '郭耘奇', '12345678901', 430, 4.8, 1000000, 0, now()),
       ('寂寞拥挤', '123456', '谢泽成', '12345678901', 430, 4.5, 1000000, 0, now()),
       ('浮云悠游', '123456', '雷淞然', '12345678901', 430, 4.6, 1000000, 0, now()),
       ('片刻永恒', '123456', '蒋诗萌', '12345678901', 430, 4.9, 1000000, 0, now()),
       ('卮言春天', '123456', '闫佩伦', '12345678901', 430, 4.7, 1000000, 0, now()),
       ('痛快哀艳', '123456', '张祐维', '12345678901', 430, 4.3, 1000000, 0, now());

use db_XMall_order;
-- 插入订单信息
insert into order_info(user_id, store_id, total_price, trans_price, address_id, pay_time, pay_way_index, send_time,
                       receive_time, finish_time, status_index)
values (100001, 1001, 5999.00, 0.00, 100001, now(), 0, null, null, null, 0),
       (100003, 1004, 5999.00, 0.00, 100001, now(), 1, now(), now(), now(), 4);

-- 插入订单商品信息
insert into order_item_info(order_id, goods_id, quantity, price)
values (1, 1, 1, 5999.00),
       (2, 7, 1, 3999.00),
       (2, 8, 1, 2000.00);

use db_XMall_after_sale;
-- 插入售后信息
insert into after_sale_info(user_id, store_id, order_id, goods_id, category_index, reason, result_index, start_time,
                            finish_time, is_finish)
values (100003, 1004, 2, 7, 0, '不想要了', 0, now(), now(), true);

use db_XMall_preference;
-- 插入优惠信息
insert into preference_info(goods_id, category_index, pref_name, pref_id, start_time, end_time)
values (1, 0, '立减10元', 1, now(), now());

-- 插入降价信息
insert into reduction_info(reduction)
values (10.00);